---
kind: type
id: T:Autodesk.Revit.DB.Electrical.LoadClassificationType
source: html/718cd7f0-fdc2-98fa-0e8b-ae47c39f0348.htm
---
# Autodesk.Revit.DB.Electrical.LoadClassificationType

An enumerated type listing all the possible load classification types for a connector object.

## Syntax (C#)
```csharp
public enum LoadClassificationType
```